In [1]:
import pandas as pd
import numpy as np

In [2]:
#任务1: 将列表转化为Numpy数组
data0 = [2, 4, 6.5, 8]
arr0 = np.array(data0)

In [3]:
#任务2： 新建pandas中的series数据类型，打印出其大小、索引值、值

In [4]:
# pandas中的series数据类型
s = pd.Series(data=[100,'a',{ 'dict': 5 }],
              index= pd.Index(['id1', 20, 'third'],name='my_idx'),
              dtype='object',
              name='my_name')

In [5]:
s2= pd.Series(['1','2','3','4'])

In [6]:
s2.index.values

array([0, 1, 2, 3], dtype=int64)

In [7]:
type(s2.values[0])

str

In [8]:
s2.shape

(4,)

In [9]:
#任务3:  创建DataFrame类型的数据,并获取其索引值、值及表大小
d1 = {
     "作者": pd.Series(['余华','莫言','史铁生']),
     "作品": pd.Series(['活着','红高粱','夏天的玫瑰']),
     "价格": pd.Series([35,72,37]),
}
df2 = pd.DataFrame(d1)

In [10]:
df2.index.values

array([0, 1, 2], dtype=int64)

In [11]:
df2.shape

(3, 3)

In [12]:
df2.size

9

In [13]:
df2['作品']

0       活着
1      红高粱
2    夏天的玫瑰
Name: 作品, dtype: object

In [14]:
贵州茅台原始数据=pd.read_csv(R'output\600519.csv')

In [15]:
#按列表查询数据
贵州茅台原始数据['TURNOVER']

0        1410347008
1         463463008
2         194689000
3         177558000
4          86231000
           ...
4089     2694714080
4090    10663392512
4091     5239853056
4092     5581027328
4093     5227695104
Name: TURNOVER, Length: 4094, dtype: int64

In [16]:
贵州茅台原始数据[['TURNOVER','volume']]

         TURNOVER  volume
0      1410347008  406318
1       463463008  129647
2       194689000   53252
3       177558000   48013
4        86231000   23231
...           ...     ...
4089   2694714080   49076
4090  10663392512  204397
4091   5239853056   96885
4092   5581027328   98107
4093   5227695104   89157

[4094 rows x 2 columns]

In [17]:
#按照行索引
贵州茅台原始数据.loc[0]

day           2001-08-27
STOCK_CODE       6005191
open               34.51
close              35.55
maximum            37.78
minimum            32.85
volume            406318
TURNOVER      1410347008
Name: 0, dtype: object

In [18]:
贵州茅台 = 贵州茅台原始数据.set_index('day')

In [19]:
贵州茅台.loc['2001-08-27','close']

35.55

In [20]:
贵州茅台.loc['2001-08-27',['open','close']]

open     34.51
close    35.55
Name: 2001-08-27, dtype: float64

In [21]:
条件1 = 贵州茅台['open'] < 35
条件2 = 贵州茅台['close'] < 35
布尔列表 = 条件1 & 条件2
贵州茅台.loc[布尔列表]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [22]:
#使用函数作为索引
def condition(pd):
    条件1 = pd['open'] < 35
    条件2 = pd['close'] < 35
    布尔列表 = 条件1 & 条件2
    return 布尔列表

In [23]:
贵州茅台.loc[condition]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [24]:
贵州茅台.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4094 entries, 2001-08-27 to 2018-11-02
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STOCK_CODE  4094 non-null   int64
 1   open        4094 non-null   float64
 2   close       4094 non-null   float64
 3   maximum     4094 non-null   float64
 4   minimum     4094 non-null   float64
 5   volume      4094 non-null   int64
 6   TURNOVER    4094 non-null   int64
dtypes: float64(4), int64(3)
memory usage: 384.9+ KB

In [25]:
贵州茅台['open'].describe()

count    4094.000000
mean      182.161910
std       165.857882
min        20.900000
25%        47.405000
50%       159.930000
75%       208.500000
max       800.000000
Name: open, dtype: float64

In [26]:
result = 贵州茅台['open'].unique()

In [27]:
result2 = 贵州茅台['open'].nunique()

In [28]:
result3 = 贵州茅台['open'].value_counts()